{
  "name": "SalesMind",
  "tagline": "SalesMind is an AI-driven salesforce platform that automates workflows with intelligent agents",
  "category": "technology",
  "mood": "minimal",
  "archetype": "Magician",
  "positioning": {
    "statement": "The future of CRM, powered by AI",
    "targetAudience": "Sales Managers",
    "differentiator": "Thoughtfully designed for technology workflows"
  },
  "voice": {
    "tone": "Professional, Innovative, Supportive",
    "style": "focused and efficient",
    "keywords": [
      "Efficiency",
      "Intelligence",
      "Empowerment"
    ]
  },
  "visual": {
    "primaryColor": "oklch(0.55 0.15 235)",
    "colorPalette": [
      "Tech Purple",
      "Cyber Blue",
      "Neon Accent"
    ],
    "aesthetic": "sleek and modern",
    "iconStyle": "geometric, sharp"
  },
  "productBrandMoments": [
    {
      "moment": "First Deploy",
      "description": "Successfully deploying first project",
      "emotion": "Excitement and accomplishment"
    },
    {
      "moment": "Problem Solved",
      "description": "Overcoming a technical challenge",
      "emotion": "Satisfaction and relief"
    },
    {
      "moment": "Integration Success",
      "description": "Connecting systems seamlessly",
      "emotion": "Efficiency and power"
    }
  ],
  "values": [
    "Efficiency",
    "Intelligence",
    "Empowerment"
  ],
  "guardrails": {
    "doSay": [
      "Simple",
      "Essential",
      "Focus",
      "Just what you need"
    ],
    "dontSay": [
      "Feature-packed",
      "All-in-one",
      "Everything you need",
      "Loaded with"
    ],
    "visualDo": [
      "Embrace whitespace",
      "Use single accent color",
      "Hide complexity"
    ],
    "visualDont": [
      "Add decorative elements",
      "Use multiple colors",
      "Show all options at once"
    ]
  },
  "visualSignature": {
    "shapeLanguage": {
      "profile": "mixed",
      "rationale": "A mixed shape language allows the Magician personality to express itself dynamically. Primary actions use rounded forms for approachability, while data displays employ sharper geometry for clarity.",
      "cornerRadiusGuidance": "Primary interactive elements use larger radii (8-12px). Secondary elements and data displays use smaller radii (2-4px). This contrast creates visual hierarchy.",
      "iconTreatment": "Navigation and action icons use softer treatments, while status and data icons employ sharper geometry. This distinction helps users quickly parse icon purpose."
    },
    "densityRhythm": {
      "profile": "balanced",
      "rationale": "A balanced density serves the technology use case without overwhelming users. This rhythm allows for both efficient work and comfortable browsing, aligned with the minimal character.",
      "contexts": {
        "tables": "Standard row heights (44-52px) with comfortable padding. Balance scanability with touch targets. Use subtle dividers.",
        "dashboards": "Moderate widget gaps (16-20px). Balance information density with visual clarity. Allow widgets to breathe.",
        "forms": "Comfortable field spacing (20-24px between fields). Clear visual grouping. Adequate space for help text and errors.",
        "navigation": "Standard navigation items (40-44px height). Include icons and text labels. Clearly distinguish active states."
      }
    },
    "contrastPhilosophy": {
      "profile": "low-contrast-calm",
      "rationale": "The minimal mood is expressed through subtle tonal shifts rather than stark contrasts. This approach reduces visual stress, essential for technology where users may spend extended time.",
      "textHierarchy": "Primary text uses medium weight rather than bold. Secondary text is only slightly lighter than primary. Headlines differ in size rather than weight.",
      "surfaceContrast": "Surfaces differ subtly—cards barely lift from backgrounds. Borders are soft or replaced with shadows. The interface feels unified and calm.",
      "emphasisStrategy": "Emphasis through size and position rather than color intensity. Use brand color sparingly. Animation can provide emphasis without visual weight."
    },
    "textureUsage": {
      "profile": "none",
      "rationale": "The technology product maintains a clean, texture-free aesthetic. This supports minimal by eliminating visual noise. Depth is created through shadows and layering, not surface treatments.",
      "allowedContexts": [
        "Subtle shadows for depth",
        "Solid color fills only",
        "Clean gradients for illustration backgrounds"
      ],
      "prohibitedContexts": [
        "Background patterns",
        "Grainy textures",
        "Illustrative textures on UI surfaces",
        "Noise overlays"
      ],
      "performanceGuidance": "No special performance considerations. CSS-based shadows and gradients are GPU-accelerated."
    },
    "motionCharacter": {
      "profile": "restrained",
      "timingPhilosophy": "Short durations (100-150ms) with gentle easing. Prefer fade over movement. Group animations complete together without drawing attention.",
      "purposeOfMotion": "Motion serves feedback and orientation only. It confirms actions, shows loading states, and maintains spatial continuity during navigation.",
      "entranceExits": "Elements appear with quick fade (100ms). Exits use fade-out. No translation on entrance. Modals appear instantly with background fade.",
      "microInteractions": "Buttons have subtle hover states (color shift only). Focus rings appear instantly. Loading spinners are simple and unobtrusive."
    },
    "layoutPhilosophy": {
      "profile": "structure-first",
      "rationale": "The technology domain benefits from clear structural organization. Users navigate by structure, finding content within predictable containers. This supports the minimal sensibility.",
      "gridUsage": "Rigid grid with consistent column widths. Content adapts to grid, creating predictable patterns. Use 12-column base with clear breakpoints.",
      "whiteSpaceIntent": "White space is systematic—consistent across similar elements. Padding and margins follow a strict scale. Predictability over personality.",
      "responsiveStrategy": "Structural landmarks persist across breakpoints. Sidebar collapses predictably. Grid adapts but maintains column relationships."
    },
    "generatedAt": "2026-01-28T10:57:08.765Z"
  },
  "iconography": {
    "iconStyle": {
      "profile": "duotone",
      "rationale": "Duotone icons add warmth and depth to the minimal personality. The two-tone treatment allows the Magician brand to express personality while maintaining clarity. For technology, this approach balances professionalism with approachability.",
      "strokeWeight": "standard",
      "strokeWeightRationale": "Standard stroke weights (1.5-2px) provide optimal legibility across device sizes. For technology, this balanced approach ensures icons remain clear at small sizes while not dominating the interface. The minimal mood is maintained through consistent, professional execution.",
      "cornerTreatment": "Navigation and action icons use rounded corners for approachability. Data and status icons use sharper corners for precision. This distinction should be consistent across icon families."
    },
    "metaphorStrategy": {
      "profile": "symbolic",
      "rationale": "Symbolic iconography allows the Magician brand to express meaning beyond the obvious. Abstract representations can convey concepts, emotions, or transformations that literal icons cannot. In technology, this approach differentiates the brand while maintaining learnability.",
      "categoryGuidance": "Symbolic tech icons work for innovative features and AI concepts where literal representation is impossible. Ground abstractions in familiar shapes.",
      "examples": {
        "preferred": [
          "Meaningful abstractions for complex concepts",
          "Expressive forms for emotional content",
          "Brand-distinctive representations"
        ],
        "avoid": [
          "Abstraction for critical actions",
          "Symbols without clear meaning",
          "Culture-specific or regional metaphors"
        ]
      }
    },
    "semanticRules": {
      "oneIconOneMeaning": "Each icon in the technology system represents exactly one concept. If \"star\" means \"favorite,\" it cannot also mean \"important\" or \"rating.\" Dual meanings create user confusion and accessibility issues.",
      "reusePolicy": "Reuse existing icons whenever the concept matches. Before creating a new icon, verify no existing icon serves the purpose. New icons require documentation of meaning and usage context. The Magician brand values consistency over novelty.",
      "newIconCriteria": [
        "The concept has no existing representation in the icon set",
        "Existing icons would cause confusion if reused for this purpose",
        "The feature is significant enough to warrant dedicated iconography",
        "The new icon can be designed to fit the established style",
        "The meaning can be communicated without explanation"
      ],
      "consistencyGuidelines": [
        "All icons in a family share the same visual weight",
        "Similar concepts use similar visual treatments",
        "Opposite concepts (add/remove, open/close) are visually related but distinct",
        "Icon size remains consistent within context (navigation, inline, feature)",
        "Color application follows the same rules across all icons"
      ]
    },
    "usageRules": {
      "do": [
        "Use only essential icons—less is more",
        "Prefer text labels where possible",
        "Keep icon designs extremely simple",
        "Remove any decorative elements"
      ],
      "dont": [
        "Add icons where text alone suffices",
        "Use complex multi-element icons",
        "Apply decorative treatments to icons",
        "Create icon-heavy interfaces",
        "Use outdated tech metaphors (floppy disk for save)",
        "Apply skeuomorphic detail unnecessarily",
        "Use emoji-style icons in professional interfaces",
        "Mix metaphors within the same icon (e.g., document with legs)"
      ]
    },
    "accessibilityGuidance": {
      "labelingExpectations": "Provide text labels for primary actions. Icon-only treatments are acceptable for universally recognized icons (close, menu, search) with appropriate ARIA labels. Complex or custom icons require visible labels.",
      "contrastConsiderations": "Icons must meet WCAG 2.1 contrast requirements. For technology, maintain minimum 3:1 contrast ratio against backgrounds for informational icons, 4.5:1 for icons conveying critical information. Disabled states may use reduced contrast but should remain distinguishable.",
      "nonVisualSignaling": "Icons must never be the only signal for important information. Pair status icons with text, color, or other indicators. Error states require text explanation. Success confirmations need explicit messaging. Users who cannot see icons must receive equivalent information.",
      "touchTargets": "Minimum touch target: 44x44px regardless of icon visual size. Icon hit areas may extend beyond visible bounds. technology interfaces should consider larger targets (48x48px) for primary actions. Maintain adequate spacing between adjacent icon targets."
    },
    "generatedAt": "2026-01-28T10:57:08.771Z"
  }
}