{
  "name": "SocialSphere",
  "tagline": "Connect and share with people in your life like never before",
  "category": "social",
  "mood": "friendly",
  "archetype": "Everyman",
  "positioning": {
    "statement": "The go-to platform for social connection and community building.",
    "targetAudience": "teenagers",
    "differentiator": "Thoughtfully designed for social workflows"
  },
  "voice": {
    "tone": "Friendly, Inclusive, Empowering",
    "style": "warm and conversational",
    "keywords": [
      "Connectivity",
      "Community",
      "Expression",
      "Empowerment"
    ]
  },
  "visual": {
    "primaryColor": "oklch(0.55 0.17 265)",
    "colorPalette": [
      "Friendly Purple",
      "Vibrant Blue",
      "Warm Pink"
    ],
    "aesthetic": "vibrant and approachable",
    "iconStyle": "filled, rounded"
  },
  "productBrandMoments": [
    {
      "moment": "First Connection",
      "description": "Making initial connection",
      "emotion": "Belonging and curiosity"
    },
    {
      "moment": "Viral Moment",
      "description": "Content resonating widely",
      "emotion": "Validation and excitement"
    },
    {
      "moment": "Community Welcome",
      "description": "Being embraced by a group",
      "emotion": "Warmth and acceptance"
    }
  ],
  "values": [
    "Connectivity",
    "Community",
    "Expression",
    "Empowerment"
  ],
  "guardrails": {
    "doSay": [
      "Hey there",
      "We got you",
      "No worries",
      "Happy to help"
    ],
    "dontSay": [
      "Dear Sir/Madam",
      "Per our policy",
      "Unfortunately",
      "Regrettably"
    ],
    "visualDo": [
      "Use warm colors",
      "Include illustrations",
      "Smile in photos"
    ],
    "visualDont": [
      "Be overly formal",
      "Use corporate stock photos",
      "Be cold or distant"
    ]
  },
  "visualSignature": {
    "shapeLanguage": {
      "profile": "balanced",
      "rationale": "A balanced shape vocabulary supports the Everyman's authority while maintaining the friendly sensibility. This measured approach ensures the social product feels neither rigid nor casual.",
      "cornerRadiusGuidance": "Use moderate radii (4-8px) consistently across the interface. Larger containers may use slightly increased radii. Maintain visual cohesion.",
      "iconTreatment": "Icons should balance geometric precision with subtle rounding at terminals. The Everyman archetype calls for clear, professional iconography that communicates efficiently."
    },
    "densityRhythm": {
      "profile": "balanced",
      "rationale": "A balanced density serves the social use case without overwhelming users. This rhythm allows for both efficient work and comfortable browsing, aligned with the friendly character.",
      "contexts": {
        "tables": "Standard row heights (44-52px) with comfortable padding. Balance scanability with touch targets. Use subtle dividers.",
        "dashboards": "Moderate widget gaps (16-20px). Balance information density with visual clarity. Allow widgets to breathe.",
        "forms": "Comfortable field spacing (20-24px between fields). Clear visual grouping. Adequate space for help text and errors.",
        "navigation": "Standard navigation items (40-44px height). Include icons and text labels. Clearly distinguish active states."
      }
    },
    "contrastPhilosophy": {
      "profile": "mixed-functional",
      "rationale": "Contrast is deployed strategically: high contrast for actions and critical information, low contrast for supporting elements. This serves social users who need both efficiency and clarity.",
      "textHierarchy": "Headings use bold weight for clear hierarchy. Body text maintains comfortable contrast. Secondary text steps down noticeably but remains readable.",
      "surfaceContrast": "Primary content areas have clear contrast. Secondary surfaces use subtle differentiation. Interactive elements stand out through targeted contrast.",
      "emphasisStrategy": "Primary actions use full brand color. Secondary actions use subtle treatments. Status and feedback use appropriate semantic colors at reduced intensity."
    },
    "textureUsage": {
      "profile": "subtle",
      "rationale": "Minimal texture adds warmth without distraction. Light gradients, subtle patterns, or noise in specific contexts reinforce the friendly mood while keeping the social interface functional.",
      "allowedContexts": [
        "Light noise on hero sections",
        "Subtle gradients on cards",
        "Muted patterns in empty states",
        "Soft shadows with slight blur"
      ],
      "prohibitedContexts": [
        "Heavy patterns on interactive elements",
        "Texture on text backgrounds",
        "Animated textures",
        "High-contrast patterns"
      ],
      "performanceGuidance": "Use CSS gradients and SVG filters when possible. Pre-generate noise textures at appropriate resolution. Avoid texture animations on scroll."
    },
    "motionCharacter": {
      "profile": "confident",
      "timingPhilosophy": "Moderate durations (150-250ms) with smooth easing. Elements settle with subtle overshoot. Stagger is minimal but perceptible.",
      "purposeOfMotion": "Motion builds trust through polish. It communicates quality and reliability. Users feel the product is well-crafted and predictable.",
      "entranceExits": "Elements scale up slightly (0.98 to 1) with fade. Exits reverse the pattern. Modals slide in from below with confident timing.",
      "microInteractions": "Buttons have smooth hover transitions. Press states are perceptible. Toggles animate smoothly. Loading states feel controlled."
    },
    "layoutPhilosophy": {
      "profile": "content-first",
      "rationale": "The social product prioritizes content accessibility. Structure serves content, not vice versa. The friendly mood emerges from thoughtful content presentation.",
      "gridUsage": "Flexible grid that adapts to content needs. Column widths respond to content type. The grid is a guide, not a constraint.",
      "whiteSpaceIntent": "White space creates content grouping. Margins between content types are generous. Internal spacing is tighter for cohesion.",
      "responsiveStrategy": "Content determines breakpoints. Key content remains visible at all sizes. Navigation simplifies but content structure persists."
    },
    "generatedAt": "2026-01-28T12:12:14.355Z"
  },
  "iconography": {
    "iconStyle": {
      "profile": "outline",
      "rationale": "Outline icons support the friendly mood by providing visual clarity without competing for attention. In social, where information density matters, outlined icons serve as efficient wayfinding without visual weight. The Everyman archetype benefits from this restrained approach that prioritizes function over decoration.",
      "strokeWeight": "standard",
      "strokeWeightRationale": "Standard stroke weights (1.5-2px) provide optimal legibility across device sizes. For social, this balanced approach ensures icons remain clear at small sizes while not dominating the interface. The friendly mood is maintained through consistent, professional execution.",
      "cornerTreatment": "Icon corners should use subtle rounding (1-2px) at stroke joins. Line caps may be round or squared depending on the specific icon. Maintain consistency within icon families."
    },
    "metaphorStrategy": {
      "profile": "literal",
      "rationale": "Literal iconography ensures instant recognition in social contexts. The Everyman brand values clarity and precision—a document icon should look like a document, a person icon should clearly represent a person. Abstraction risks confusion in professional workflows.",
      "categoryGuidance": "Social platform icons should use established conventions. Users, messaging, reactions—platforms benefit from pattern recognition.",
      "examples": {
        "preferred": [
          "Standard representations for common concepts",
          "Industry-recognized metaphors",
          "Consistent object representation"
        ],
        "avoid": [
          "Overly abstract forms for concrete concepts",
          "Unusual metaphors that require learning",
          "Decorative complexity"
        ]
      }
    },
    "semanticRules": {
      "oneIconOneMeaning": "Each icon in the social system represents exactly one concept. If \"star\" means \"favorite,\" it cannot also mean \"important\" or \"rating.\" Dual meanings create user confusion and accessibility issues.",
      "reusePolicy": "Reuse existing icons whenever the concept matches. Before creating a new icon, verify no existing icon serves the purpose. New icons require documentation of meaning and usage context. The Everyman brand values consistency over novelty.",
      "newIconCriteria": [
        "The concept has no existing representation in the icon set",
        "Existing icons would cause confusion if reused for this purpose",
        "The feature is significant enough to warrant dedicated iconography",
        "The new icon can be designed to fit the established style",
        "The meaning can be communicated without explanation"
      ],
      "consistencyGuidelines": [
        "All icons in a family share the same visual weight",
        "Similar concepts use similar visual treatments",
        "Opposite concepts (add/remove, open/close) are visually related but distinct",
        "Icon size remains consistent within context (navigation, inline, feature)",
        "Color application follows the same rules across all icons"
      ]
    },
    "usageRules": {
      "do": [
        "Soften icons with rounded treatments",
        "Use icons to create welcoming touchpoints",
        "Add subtle personality to empty states",
        "Maintain approachable proportions"
      ],
      "dont": [
        "Use cold, institutional iconography",
        "Apply harsh, angular icon treatments",
        "Neglect personality in empty states",
        "Create intimidating visual density",
        "Deviate from established social conventions",
        "Apply unfamiliar metaphors for common actions",
        "Use emoji-style icons in professional interfaces",
        "Mix metaphors within the same icon (e.g., document with legs)"
      ]
    },
    "accessibilityGuidance": {
      "labelingExpectations": "Provide text labels for primary actions. Icon-only treatments are acceptable for universally recognized icons (close, menu, search) with appropriate ARIA labels. Complex or custom icons require visible labels.",
      "contrastConsiderations": "Icons must meet WCAG 2.1 contrast requirements. For social, maintain minimum 3:1 contrast ratio against backgrounds for informational icons, 4.5:1 for icons conveying critical information. Disabled states may use reduced contrast but should remain distinguishable.",
      "nonVisualSignaling": "Icons must never be the only signal for important information. Pair status icons with text, color, or other indicators. Error states require text explanation. Success confirmations need explicit messaging. Users who cannot see icons must receive equivalent information.",
      "touchTargets": "Minimum touch target: 44x44px regardless of icon visual size. Icon hit areas may extend beyond visible bounds. social interfaces should consider larger targets (48x48px) for primary actions. Maintain adequate spacing between adjacent icon targets."
    },
    "generatedAt": "2026-01-28T12:12:14.361Z"
  }
}